## Metro Scooters Analysis
In May of 2018, Bird dropped hundreds of scooters on the streets of Nashville with no permission. In response, Metro sued, which caused Bird to remove and wait for permits. Metro began developing regulations for scooters and other shared urban mobility devices (SUMDs). In 2019, the Metro Council passed legislation enacting a one-year pilot program for scooters. For this project, you have been provided with the data for 3 months of this pilot program with the goal of reporting on usage trends and generating recommendations for quantity and distribution of scooters in Nashville.

Metro would like to know what the ideal density of available scooters is, which balances the objectives of
enabling scooters to serve transportation goals,
discouraging scooters from piling up on sidewalks,
keeping it economically viable for companies to operate equitably in the city.

This data for this project can be downloaded as a Postgres backup from https://drive.google.com/file/d/1BXAfByFvHCwX0G1BvTCQ373qKm7wE4Y-/view?usp=share_link.

Some notes about the data:
* When not in use, each scooter will report its location every five minutes. This data is contained in the scooters table.
* WARNING: Both tables contain a large number of records, so think carefully about what data you need to pull in a given query. If you try and pull in all rows from the scooters table, there is a very good chance that you will crash your notebook!

As you know, it's important to gain an understanding of new datasets before diving headlong into analysis. Here are some suggestions for guiding the process of getting to know the data contained in these tables:
- Are there any null values in any columns in either table?
- What date range is represented in each of the date columns? Investigate any values that seem odd.
- Is time represented with am/pm or using 24 hour values in each of the columns that include time?
- What values are there in the sumdgroup column? Are there any that are not of interest for this project?
- What are the minimum and maximum values for all the latitude and longitude columns? Do these ranges make sense, or is there anything surprising?
-What is the range of values for trip duration and trip distance? Do these values make sense? Explore values that might seem questionable.
- Check out how the values for the company name column in the scooters table compare to those of the trips table. What do you notice?

Once you've gotten an understanding of what is contained in the available tables, start with addressing these questions:
1. During this period, seven companies offered scooters. How many scooters did each company have in this time frame? Did the number for each company change over time? Did scooter usage vary by company?
2. According to Second Substitute Bill BL2018-1202 (as amended) (https://web.archive.org/web/20181019234657/https://www.nashville.gov/Metro-Clerk/Legislative/Ordinances/Details/7d2cf076-b12c-4645-a118-b530577c5ee8/2015-2019/BL2018-1202.aspx), all permitted operators will first clean data before providing or reporting data to Metro. Data processing and cleaning shall include:  
* Removal of staff servicing and test trips  
* Removal of trips below one minute  
* Trip lengths are capped at 24 hours  
Are the scooter companies in compliance with the second and third part of this rule? 
3. The goal of Metro Nashville is to have each scooter used a minimum of 3 times per day. Based on the data, what is the average number of trips per scooter per day? Make sure to consider the days that a scooter was available. How does this vary by company?
4. What is the highest count of scooters being used at the same time? When did it occur? Does this vary by zip code or other geographic region?
4. SUMDs can provide alternative transportation and provide "last mile" access to public transit. How often are trips starting near public transit hubs? You can download a dataset of bus stop locations from https://data.nashville.gov/Transportation/Regional-Transportation-Authority-Bus-Stops/p886-fnbd.

Deliverables:
At the conclusion of this project, your group should deliver a presentation which addresses the following points:
* Are scooter companies in compliance with the required data cleaning?
* What are typical usage patterns for scooters in terms of time, location, and trip duration?
* Does it appear that scooters are used as "last mile" transportation from public transit hubs to work or school?
* What are your recommendations for total number of scooters for the city overall and density of scooters by zip code?

In [1]:
from sqlalchemy import create_engine, text
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
import seaborn as sns

EDA
1. Are there any null values in any columns in either table?
2. What date range is represented in each of the date columns? Investigate any values that seem odd.
3. Is time represented with am/pm or using 24 hour values in each of the columns that include time?
4. What values are there in the sumdgroup column? Are there any that are not of interest for this project?
5. What are the minimum and maximum values for all the latitude and longitude columns? 
    A. Do these ranges make sense, or is there anything surprising? 
    B. -What is the range of values for trip duration and trip distance?
        i. Do these values make sense?
        ii. Explore values that might seem questionable.
6. Check out how the values for the company name column in the scooters table compare to those of the trips table. What do you notice?

In [2]:
database_name = 'scooters'    # Fill this in with your scooters database name

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

engine = create_engine(connection_string)

query = """
SELECT *
FROM trips
where pubtimestamp is null
or companyname is null
or triprecordnum is null
or sumdid is null
or tripduration is null
or tripdistance is null
or startdate is null
or starttime is null
or enddate is null
or endtime is null 
or startlatitude is null
or startlongitude is null
or triproute is null
or create_dt is null
"""

null_trips = pd.read_sql(text(query), con = engine)
null_trips.head()

Empty DataFrame
Columns: [pubtimestamp, companyname, triprecordnum, sumdid, tripduration, tripdistance, startdate, starttime, enddate, endtime, startlatitude, startlongitude, endlatitude, endlongitude, triproute, create_dt]
Index: []

In [3]:
query = """
select
*
from scooters
where pubdatetime is null
or latitude is null
or longitude is null
or sumdid is null
or sumdtype is null
or chargelevel is null
or sumdgroup is null
or costpermin is null
or companyname is null;
"""

null_scooters = pd.read_sql(text(query), con = engine)
row_count= len(null_scooters)
row_count

770

In [4]:
query = """
select
min(pubdatetime),
max(pubdatetime)
from scooters;
"""

min_max_dates_scooters = pd.read_sql(text(query), con = engine)
min_max_dates_scooters

                      min                 max
0 2019-05-01 00:01:41.247 2019-07-31 23:59:57

In [5]:
query = """
SELECT 
min(startdate) as startdate_min,
max(startdate) as startdate_max,
min(enddate) as enddate_min,
max(enddate) as enddate_max
FROM trips
"""

min_max_dates_trips = pd.read_sql(text(query), con = engine)
min_max_dates_trips

  startdate_min startdate_max enddate_min enddate_max
0    2019-05-01    2019-07-31  2019-05-01  2019-08-01

In [6]:
query = """
select
pubdatetime
from scooters
limit 1;

"""

pubdatetime_scooters = pd.read_sql(text(query), con = engine)
pubdatetime_scooters

          pubdatetime
0 2019-07-01 10:34:18

In [7]:
query = """
SELECT pubtimestamp
FROM trips
limit 1;

"""
time_trips = pd.read_sql(text(query), con = engine)
time_trips

             pubtimestamp
0 2019-05-26 04:36:51.443

In [8]:
query = """
SELECT 
t.sumdid as t_sum,
s.sumdid as s_sum
FROM trips as t
JOIN scooters as s
ON t.sumdid=s.sumdid
limit 5;

"""
sumdid_trips_scooters=  pd.read_sql(text(query), con = engine)
sumdid_trips_scooters

           t_sum          s_sum
0  Powered787594  Powered787594
1  Powered787594  Powered787594
2  Powered787594  Powered787594
3  Powered787594  Powered787594
4  Powered787594  Powered787594

In [9]:
query = """
SELECT 
min(startlatitude) as startlat_min,
max(startlatitude) as startlat_max,
min(startlongitude) as startlong_min,
max(startlongitude) as startlong_max
FROM trips as t
"""

lat_long_trips=  pd.read_sql(text(query), con = engine)
lat_long_trips

   startlat_min  startlat_max  startlong_min  startlong_max
0       35.8532     36.300029     -86.918008       -86.3662

In [10]:
query = """
SELECT
min(latitude) as lat_min,
max(latitude) as lat_max,
min(longitude) as long_min,
max(longitude) as long_max
FROM scooters as s
"""

lat_long_scooters=  pd.read_sql(text(query), con = engine)
lat_long_scooters

   lat_min       lat_max   long_min  long_max
0      0.0  3.609874e+06 -97.443879       0.0

In [14]:
query = """
SELECT
distinct(companyname)
FROM scooters as s
limit 1000
"""

comp_name_scooters=  pd.read_sql(text(query), con = engine)
comp_name_scooters

  companyname
0        Bird
1        Bolt
2      Gotcha
3        Jump
4        Lime
5        Lyft
6        Spin

In [15]:
query = """
SELECT
distinct(companyname)
FROM trips as t
limit 1000
"""

comp_name_trips=  pd.read_sql(text(query), con = engine)
comp_name_trips

     companyname
0           Bird
1  Bolt Mobility
2         Gotcha
3           JUMP
4           Lime
5           Lyft
6           SPIN

1. During this period, seven companies offered scooters. How many scooters did each company have in this time frame? Did the number for each company change over time? Did scooter usage vary by company?

In [24]:
query = """
select
distinct companyname,
to_char(pubdatetime, 'Mon') as month,
count(distinct sumdid) as counts
from scooters
where sumdgroup != 'bicycle'
group by
distinct companyname,
to_char(pubdatetime, 'Mon')
Order by counts

"""
scooters_by_month=  pd.read_sql(text(query), con = engine)
scooters_by_month

   companyname month  counts
0       Gotcha   Jun     223
1       Gotcha   May     223
2       Gotcha   Jul     224
3         Bolt   Jul     276
4         Bolt   Jun     333
5         Bolt   May     346
6         Spin   Jul     570
7         Spin   May     687
8         Spin   Jun     713
9         Lime   Jul     902
10        Jump   May     976
11        Lyft   Jul    1026
12        Jump   Jun    1036
13        Lyft   Jun    1152
14        Jump   Jul    1206
15        Lyft   May    1376
16        Lime   Jun    1455
17        Lime   May    1631
18        Bird   Jul    2583
19        Bird   Jun    2910
20        Bird   May    3064

In [25]:
months_dict={'May':5,'Jun':6,'Jul':7}
scooters_by_month['month2']=scooters_by_month['month'].map(months_dict)
#scooters_by_month=scooters_by_month.sort_values(by='month')
scooters_by_month

   companyname month  counts  month2
0       Gotcha   Jun     223       6
1       Gotcha   May     223       5
2       Gotcha   Jul     224       7
3         Bolt   Jul     276       7
4         Bolt   Jun     333       6
5         Bolt   May     346       5
6         Spin   Jul     570       7
7         Spin   May     687       5
8         Spin   Jun     713       6
9         Lime   Jul     902       7
10        Jump   May     976       5
11        Lyft   Jul    1026       7
12        Jump   Jun    1036       6
13        Lyft   Jun    1152       6
14        Jump   Jul    1206       7
15        Lyft   May    1376       5
16        Lime   Jun    1455       6
17        Lime   May    1631       5
18        Bird   Jul    2583       7
19        Bird   Jun    2910       6
20        Bird   May    3064       5